In [2]:
import pandas as pd
import numpy as np

In [2]:
x=np.array([2,3,4,5,6])
type(x)

numpy.ndarray

In [3]:
data=pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [5]:
data[0]

0.25

In [6]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [7]:
pd.Series({2:'a',3:'b',1:'a'},index=[2,4])

2      a
4    NaN
dtype: object

In [8]:
type(np.nan)

float

In [9]:
x=pd.Series({'a':1,'b':2,'c':3})
y=pd.Series({'a':1,'b':2,'d':3})
d=pd.DataFrame({'col1':x,'col2':y})

In [10]:
d['col1']+d['col2']

a    2.0
b    4.0
c    NaN
d    NaN
dtype: float64

In [11]:
d.sum(axis=1)

a    2.0
b    4.0
c    3.0
d    3.0
dtype: float64

In [12]:
x=pd.Series({'a':1,'b':2,'c':3})
x.reset_index(drop=True)

0    1
1    2
2    3
dtype: int64

In [13]:
area=pd.Series({'california':423567,'texas':123456,'new york':345678})
pop=pd.Series({'california':765432,'texas':987123,'illinos':10987})
data=pd.DataFrame({'area':area,'pop':pop})
data

                area       pop
california  423567.0  765432.0
illinos          NaN   10987.0
new york    345678.0       NaN
texas       123456.0  987123.0

In [14]:
data['density']=data['pop']/data['area']

In [15]:
data

                area       pop   density
california  423567.0  765432.0  1.807110
illinos          NaN   10987.0       NaN
new york    345678.0       NaN       NaN
texas       123456.0  987123.0  7.995747

In [16]:
data.reset_index(inplace=True)

In [17]:
data

        index      area       pop   density
0  california  423567.0  765432.0  1.807110
1     illinos       NaN   10987.0       NaN
2    new york  345678.0       NaN       NaN
3       texas  123456.0  987123.0  7.995747

In [18]:
data.rename({'index':'cities'},axis=1,inplace=True)

In [19]:
data

       cities      area       pop   density
0  california  423567.0  765432.0  1.807110
1     illinos       NaN   10987.0       NaN
2    new york  345678.0       NaN       NaN
3       texas  123456.0  987123.0  7.995747

In [20]:
data.T

                  0        1         2        3
cities   california  illinos  new york    texas
area         423567      NaN    345678   123456
pop          765432    10987       NaN   987123
density     1.80711      NaN       NaN  7.99575

In [22]:
rng=np.random.RandomState(42)
df=pd.DataFrame()

SyntaxError: invalid syntax (<ipython-input-22-cc3012c7c7d2>, line 1)

In [23]:
df.applymap(lambda x:x*2 if x>5 else x)

NameError: name 'df' is not defined

In [24]:
A=pd.DataFrame(rng.randint(0,20,(2,2)),columns=['B','A'])
A

NameError: name 'rng' is not defined

In [25]:
type(None)

NoneType

In [3]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [6]:
data['density']=data['pop']/data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [7]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [8]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [9]:
data.iloc[:3,:2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [10]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [11]:
data.loc[:'Illinois',:'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [12]:
data.ix[:3,:'pop']

AttributeError: 'DataFrame' object has no attribute 'ix'

In [13]:
data.loc[data.density>100,['pop','density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [14]:
data.iloc[0,2]=90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [15]:
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [16]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [17]:
data[data.density>100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

In [18]:
rng=np.random.RandomState(42)

In [19]:
df=pd.DataFrame(rng.randint(0,10,(3,4)),
               columns=['A','B','C','D'])

In [20]:
df

   A  B  C  D
0  6  3  7  4
1  6  9  2  6
2  7  4  3  7

In [21]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [22]:
population

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [23]:
area

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

In [24]:
population/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [26]:
area.index|population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')